app/controllers/home_page_admins_controller.rb

SELECT COUNT(*) FROM `users`
SELECT  `users`.* FROM `users` LIMIT 11
---
  def index
    @users = User.search(params[:search]).order(sort_column => sort_direction).page(params[:page])

INSERT INTO `users` (`first_name`, `middle_name`, `last_name`, `phone_number`, `country`, `email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('Changedadsasd', 'Rana', 'Tigrina', 4622313, 'AF', 'guzesozoasdasdan@mailinator.com', '$2a$12$6qHI4CWKEPInx5te8vJ0zuNpMkOA23OK4yZGPsIxLp/NgQXdNTJue', '2020-09-04 06:03:33', '2020-09-04 06:03:33')
---
  def create_user
    @user = User.new(user_params)
    @user.skip_password_validation = true
    @user.skip_confirmation!
    respond_to do |format|
      if @user.save