app/controllers/home_page_admins_controller.rb

UPDATE `users` SET `first_name` = 'Curranaaaaaaaaaqqqq', `country` = 'AF', `encrypted_password` = '$2a$12$lgt214A1dtHZyQGBCqxe8unkD1ICU3AfqqkSi66UN.BJEta.Ph9/a', `updated_at` = '2020-09-04 06:15:24' WHERE `users`.`id` = 10
---
	def update_user

   	respond_to do |format|
      if @user.update(user_params)

DELETE FROM `users` WHERE `users`.`id` = 10
---
	def destroy
		if @user.destroy